cf/Catalogs/FileVersions.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>FileVersions</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Files</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModificationDateUniversal</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileModificationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Encrypted</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PictureIndex</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VersionNumber</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DigitallySigned</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FullDescr</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PathToFile</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Size</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Extension</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentalVersion</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextExtractionStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.FileTextExtractionStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TextStorage</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileStorageType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.FileStorageTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Volume</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.FileStorageVolumes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FileStorage</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>DigitalSignatures</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>SignatureDate</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>SignatureFileName</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>260</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Comment</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CertificateIsIssuedTo</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Imprint</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>28</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Signature</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Signer</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Users</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Certificate</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Enums/FileTextExtractionStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>FileTextExtractionStatuses</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>NotExtracted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Extracted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExtractFailed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/FileStorageTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>FileStorageTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>InInfobase</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InVolumesOnDrive</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/FileVersions/Ext/ObjectModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region EventsHandlers

Procedure BeforeWrite(Cancel)
	
	If DataExchange.Load Then 
		Return;
	EndIf;
	
	If AdditionalProperties.Property("FileConversion") Then
		Return;
	EndIf;
	
	If AdditionalProperties.Property("FilePlacementInVolumes") Then
		Return;
	EndIf;
	
	If IsNew() Then
		ParentalVersion = Owner.CurrentVersion;
	EndIf;
	
	If Not IsNew() Then
		
		DeletionMarkIsMarked = DeletionMark AND Not DeletionMarkInIB();
		
		DigitallySignedObjectRecord = False;
		If AdditionalProperties.Property("DigitallySignedObjectRecord") Then
			DigitallySignedObjectRecord = AdditionalProperties.DigitallySignedObjectRecord;
		EndIf;
		
		// Allow to mark the signed version for deletion.
		If Not PrivilegedMode() AND DigitallySignedObjectRecord <> True AND Not DeletionMarkIsMarked Then
			
			If ValueIsFilled(Ref) Then
				
				AttributesStructure = CommonUse.ObjectAttributesValues(Ref, "DigitallySigned, Encrypted");
				RefDigitallySigned = AttributesStructure.DigitallySigned;
				RefEncrypted = AttributesStructure.Encrypted;
				
				If DigitallySigned AND RefDigitallySigned Then
					Raise NStr("en='Cannot edit the digitally signed version.';ru='Подписанную версию нельзя редактировать.'");
				EndIf;
				
				If Encrypted AND RefEncrypted AND DigitallySigned AND Not RefDigitallySigned Then
					Raise NStr("en='Encrypted file cannot be signed.';ru='Зашифрованный файл нельзя подписывать.'");
				EndIf;
				
			EndIf;
		
		EndIf;
	EndIf;
	
	// Set the icon index when writing the object.
	PictureIndex = FileFunctionsServiceClientServer.GetFileIconIndex(Extension);
	
	If TextExtractionStatus.IsEmpty() Then
		TextExtractionStatus = Enums.FileTextExtractionStatuses.NotExtracted;
	EndIf;
	
	If TypeOf(Owner) = Type("CatalogRef.Files") Then
		Description = TrimAll(FullDescr);
	EndIf;
	
	If Owner.CurrentVersion = Ref Then
		If DeletionMark = True AND Owner.DeletionMark <> True Then
			Raise NStr("en='Active version cannot be deleted.';ru='Активную версию нельзя удалить.'");
		EndIf;
	ElsIf ParentalVersion.IsEmpty() Then
		If DeletionMark = True AND Owner.DeletionMark <> True Then
			Raise NStr("en='The first version cannot be deleted.';ru='Первую версию нельзя удалить.'");
		EndIf;
	ElsIf DeletionMark = True AND Owner.DeletionMark <> True Then
		// Clear the reference to parent one for subordinate and marked versions - 
		// change the parent version to the deleted version.
		Query = New Query;
		Query.Text = 
			"SELECT
			|	FileVersions.Ref AS Ref
			|FROM
			|	Catalog.FileVersions AS FileVersions
			|WHERE
			|	FileVersions.ParentalVersion = &ParentalVersion";
		
		Query.SetParameter("ParentalVersion", Ref);
		
		Result = Query.Execute();
		
		If Not Result.IsEmpty() Then
			Selection = Result.Select();
			Selection.Next();
			
			Object = Selection.Ref.GetObject();
			LockDataForEdit(Object.Ref);
			Object.ParentalVersion = ParentalVersion;
			Object.Write();
		EndIf;
	EndIf;
	
EndProcedure

Procedure BeforeDelete(Cancel)
	
	If FileStorageType = Enums.FileStorageTypes.InVolumesOnDrive Then
		If Not Volume.IsEmpty() Then
			FullPath = FileFunctionsService.FullPathOfVolume(Volume) + PathToFile; 
			Try
				File = New File(FullPath);
				File.SetReadOnly(False);
				DeleteFiles(FullPath);
				
				PathWithSubdirectory = File.Path;
				FileArrayInDirectory = FindFiles(PathWithSubdirectory, "*.*");
				If FileArrayInDirectory.Count() = 0 Then
					DeleteFiles(PathWithSubdirectory);
				EndIf;
				
			Except
				// Exception processing is not required.
			EndTry;
		EndIf;
	EndIf;
	
	// Check DataExchange.Load should be started from this string.
	
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

// Returns the current value of the deletion mark in infobase.
Function DeletionMarkInIB()
	
	Query = New Query;
	Query.Text = 
		"SELECT
		|	FileVersions.DeletionMark
		|FROM
		|	Catalog.FileVersions AS FileVersions
		|WHERE
		|	FileVersions.Ref = &Ref";
	
	Query.SetParameter("Ref", Ref);
	
	Result = Query.Execute();
	
	If Not Result.IsEmpty() Then
		Selection = Result.Select();
		Selection.Next();
		Return Selection.DeletionMark;
	EndIf;
	
	Return Undefined;
	
EndFunction

#EndRegion

#EndIf
